public/programming/unix.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="../subjects.html">Subjects</a> &gt; <a href="programming.html">Programming</a> &gt;
</p>

<div id="outline-container-org83285b1" class="outline-2">
<h2 id="org83285b1">UNIX</h2>
<div class="outline-text-2" id="text-org83285b1">
<p>
The UNIX philosophy and culture has been really influential to my
growth as a programmer.
</p>

<p>
It all boils down to KISS:
</p>

<p>
&gt; Keep It Simple, Stupid!
</p>

<p>
<a href="https://en.wikipedia.org/wiki/Douglas_McIlroy">Douglas McIlroy</a> documents the philosophy in the Bell System Technical
Journal as follows:
</p>

<ol class="org-ol">
<li>Make each program do one thing well. To do a new job, build afresh
rather than complicate old programs by adding new "features".</li>
<li>Expect the output of every program to become the input to another,
as yet unknown, program. Don't clutter output with extraneous
information. Avoid stringently columnar or binary input
formats. Don't insist on interactive input.</li>
<li>Design and build software, even operating systems, to be tried
early, ideally within weeks. Don't hesitate to throw away the
clumsy parts and rebuild them.</li>
<li>Use tools in preference to unskilled help to lighten a programming
task, even if you have to detour to build the tools and expect to
throw some of them out after you've finished using them.</li>
</ol>

<p>
As <a href="https://cscie28.dce.harvard.edu/reference/programming/unix-esr.html">Eric S. Raymond</a> puts It:
</p>

<p>
&gt; To do the Unix philosophy right [..] you need to <span class="underline">care</span>. You need to
<span class="underline">play</span>. You need to be willing to <span class="underline">explore</span>.
</p>

<hr />

<p>
Travel: <a href="programming.html">Programming</a>, <a href="../theindex.html">Index</a> 
</p>
</div>
</div>
</div>
</body>
</html>
